package com.cbsystematics.homeworks.hw13.taskExtra;

public class Main {
    
    public static void main(String[] args) {
        /*
        Создать 2 произвольных класса с полями и методами.Необходимо синхронизировать методы этих классов между собой,
        т.е. чтобы выводило на экран значения друг за другом (1 класс, 2 класс, 1, 2и т.д.).
        
        Вот как понять это задание? !!!
        2 произвольных класса - никак между собой не связанных.
        синхронизировать методы этих классов между собой - синхронизируются общие ресурсы!
        
        Что значит синхронизировать "твердое" с "зеленым"?
        
        Зачем тут поля и методы?
        Какие значения должно выводить?
        
        Ну как можно составить такое задание?
        */
    }
}
